# -*- coding: utf-8 -*-


def add_bun(top=False):
    print('И накрываем второй половинкой булочки, прижаренной на гриле' if top else 'Берём карамелизованную булочку')


def add_beefsteak():
    print('Сверху кладём два рубленых бифштекса из натуральной цельной говядины')


def add_cucumber():
    print('Добавляем пару кусочков маринованного огурчика')


def add_tomato():
    pass    # помидор нам ни в одном рецепте не пригодится, но он есть в тексте задания, поэтому вот


def add_sauce():
    print('Заправляем горчицей, кетчупом, приправляем мелко рубленным луком-шалот')


def add_cheese():
    print('Перемежая их квадратиками сыра «Чеддер»')
